xfsmart/betaflight/src/platform/common/stm32/config_flash.c
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_PAGES,
            .NbPages       = 1
        };
        getFLASHSectorForEEPROM(address, &EraseInitStruct.Banks, &EraseInitStruct.Page);
        uint32_t SECTORError;
        const HAL_StatusTypeDef status = HAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != HAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint64_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const HAL_StatusTypeDef status = HAL_FLASH_Program(FLASH_TYPEPROGRAM_DOUBLEWORD, address, *buffer);
    if (status != HAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(AT32F4)
    if (address % FLASH_PAGE_SIZE == 0) {
        const flash_status_type status = flash_sector_erase(address);
        if (status != FLASH_OPERATE_DONE) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const flash_status_type status = flash_word_program(address, *buffer);
    if (status != FLASH_OPERATE_DONE) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(APM32F4)
    if (address % FLASH_PAGE_SIZE == 0) {
        FLASH_EraseInitTypeDef EraseInitStruct = {
            .TypeErase     = FLASH_TYPEERASE_SECTORS,
            .VoltageRange  = FLASH_VOLTAGE_RANGE_3, // 2.7-3.6V
            .NbSectors     = 1
        };
        EraseInitStruct.Sector = getFLASHSectorForEEPROM();
        uint32_t SECTORError;
        const DAL_StatusTypeDef status = DAL_FLASHEx_Erase(&EraseInitStruct, &SECTORError);
        if (status != DAL_OK) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const DAL_StatusTypeDef status = DAL_FLASH_Program(FLASH_TYPEPROGRAM_WORD, address, *buffer);
    if (status != DAL_OK) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(STM32F4)
    if (address % FLASH_PAGE_SIZE == 0) {
        const FLASH_Status status = FLASH_EraseSector(getFLASHSectorForEEPROM(), VoltageRange_3); //0x08080000 to 0x080A0000
        if (status != FLASH_COMPLETE) {
            return CONFIG_RESULT_FAILURE;
        }
    }

    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");
    const FLASH_Status status = FLASH_ProgramWord(address, *buffer);
    if (status != FLASH_COMPLETE) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }
#elif defined(FT32F4)
    STATIC_ASSERT(CONFIG_STREAMER_BUFFER_SIZE == sizeof(uint32_t),  "CONFIG_STREAMER_BUFFER_SIZE does not match written size");

    const uint32_t data = *buffer;
    const uintptr_t configStart = (uintptr_t)&__config_start;
    const uintptr_t configEnd = (uintptr_t)&__config_end;
    const uint32_t clearFlags = FLASH_FR_EOP | FLASH_FR_PGERR | FLASH_FR_PGSERR | FLASH_FR_WRPRTERR;
    const uint32_t operationMask = FLASH_WRC_PG | FLASH_WRC_PER | FLASH_WRC_MER | FLASH_WRC_STRT
        | FLASH_WRC_PNB_Msk | FLASH_WRC_ESIZE_0 | FLASH_WRC_ESIZE_1;
    configStreamerResult_e result = CONFIG_RESULT_SUCCESS;
#if defined(FT32_CACHE_ENABLE) && FT32_CACHE_ENABLE
    uint32_t cacheState = 0U;
#endif

    if ((address & (sizeof(uint32_t) - 1U)) != 0U
        || address < configStart
        || address > configEnd - sizeof(uint32_t)
        || (FLASH->WRC & FLASH_WRC_LOCK) != 0U) {
        return CONFIG_RESULT_ADDRESS_INVALID;
    }

    RCC->CR |= RCC_CR_HSION;
    uint32_t timeout = FLASH_ER_PRG_TIMEOUT;
    while ((RCC->CR & RCC_CR_HSIRDY) == 0U && timeout != 0U) {
        timeout--;
    }
    if ((RCC->CR & RCC_CR_HSIRDY) == 0U) {
        return CONFIG_RESULT_TIMEOUT;
    }

    const uint32_t savedPrimask = __get_PRIMASK();
    __disable_irq();
    __DSB();
    __ISB();

#if defined(FT32_CACHE_ENABLE) && FT32_CACHE_ENABLE
    // Flash data/code may be resident in the FT32 D/I caches.  Disable both
    // with a call-free SRAM sequence while this routine changes Flash.
    if ((ICACHE->ICACHE_CTRL & CACHE_CTRL_CEN_Msk) != 0U) {
        cacheState |= FT32_CONFIG_CACHE_STATE_ICACHE;
    }
    if ((DCACHE->DCACHE_CTRL & CACHE_CTRL_CEN_Msk) != 0U) {
        cacheState |= FT32_CONFIG_CACHE_STATE_DCACHE;
    }

    DCACHE->DCACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
    ICACHE->ICACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
    __DSB();

    timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
    while ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
        timeout--;
    }
    if ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
        goto ft32FlashReset;
    }

    timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
    while ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
        timeout--;
    }
    if ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
        goto ft32FlashReset;
    }

    __ISB();
#endif

    timeout = FLASH_ER_PRG_TIMEOUT;
    while ((FLASH->FR & FLASH_FR_BSY) != 0U && timeout != 0U) {
        timeout--;
    }
    if ((FLASH->FR & FLASH_FR_BSY) != 0U) {
        goto ft32FlashReset;
    }
    if (timeout == 0U) {
        result = CONFIG_RESULT_TIMEOUT;
        goto ft32FlashRestorePrimask;
    }

    if ((address % FLASH_PAGE_SIZE) == 0U) {
        const uint32_t page = (uint32_t)((address - FLASH_BASE) / FLASH_PAGE_SIZE);
        uint32_t wrc = FLASH->WRC & ~operationMask;

        FLASH->FR = clearFlags;
        wrc |= FLASH_WRC_PER | (page << FLASH_WRC_PNB_Pos);
        FLASH->WRC = wrc;
        FLASH->WRC = wrc | FLASH_WRC_STRT;

        timeout = FLASH_ER_PRG_TIMEOUT;
        while ((FLASH->FR & FLASH_FR_BSY) != 0U && timeout != 0U) {
            timeout--;
        }
        if ((FLASH->FR & FLASH_FR_BSY) != 0U) {
            goto ft32FlashReset;
        }

        const uint32_t eraseStatus = FLASH->FR;
        FLASH->WRC &= ~(FLASH_WRC_PER | FLASH_WRC_STRT | FLASH_WRC_PNB_Msk | FLASH_WRC_ESIZE_0 | FLASH_WRC_ESIZE_1);

