xfsmart/betaflight/src/platform/common/stm32/config_flash.c
        if (timeout == 0U) {
            result = CONFIG_RESULT_TIMEOUT;
            goto ft32FlashRestorePrimask;
        }
        if ((eraseStatus & FLASH_FR_WRPRTERR) != 0U) {
            result = CONFIG_RESULT_ADDRESS_INVALID;
            goto ft32FlashRestorePrimask;
        }
        if ((eraseStatus & (FLASH_FR_PGERR | FLASH_FR_PGSERR)) != 0U) {
            result = CONFIG_RESULT_FAILURE;
            goto ft32FlashRestorePrimask;
        }

        const volatile uint32_t *erased = (const volatile uint32_t *)address;
        for (unsigned i = 0; i < FLASH_PAGE_SIZE / sizeof(uint32_t); i++) {
            if (erased[i] != UINT32_MAX) {
                result = CONFIG_RESULT_FAILURE;
                goto ft32FlashRestorePrimask;
            }
        }
    }

    FLASH->FR = clearFlags;
    FLASH->WRC = (FLASH->WRC & ~operationMask) | FLASH_WRC_PG;
    *(volatile uint32_t *)address = data;

    timeout = FLASH_ER_PRG_TIMEOUT;
    while ((FLASH->FR & FLASH_FR_BSY) != 0U && timeout != 0U) {
        timeout--;
    }
    if ((FLASH->FR & FLASH_FR_BSY) != 0U) {
        goto ft32FlashReset;
    }

    const uint32_t programStatus = FLASH->FR;
    FLASH->WRC &= ~FLASH_WRC_PG;

    if (timeout == 0U) {
        result = CONFIG_RESULT_TIMEOUT;
    } else if ((programStatus & FLASH_FR_WRPRTERR) != 0U) {
        result = CONFIG_RESULT_ADDRESS_INVALID;
    } else if ((programStatus & (FLASH_FR_PGERR | FLASH_FR_PGSERR)) != 0U
        || *(const volatile uint32_t *)address != data) {
        result = CONFIG_RESULT_INCOMPLETE;
    }

ft32FlashRestorePrimask:
#if defined(FT32_CACHE_ENABLE) && FT32_CACHE_ENABLE
    if (cacheState != 0U) {
        bool cacheRestoreSucceeded = true;

        // Re-establish the disabled state before invalidation and re-enable.
        DCACHE->DCACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
        ICACHE->ICACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
        __DSB();

        timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
        while ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
            timeout--;
        }
        if ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
            goto ft32FlashReset;
        }

        timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
        while ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
            timeout--;
        }
        if ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
            goto ft32FlashReset;
        }

        timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
        while ((((ICACHE->ICACHE_CTRL & CACHE_CTRL_INV_Msk) != 0U)
            || ((ICACHE->ICACHE_SR & CACHE_SR_INVST_Msk) != 0U)) && timeout != 0U) {
            timeout--;
        }
        if (((ICACHE->ICACHE_CTRL & CACHE_CTRL_INV_Msk) != 0U)
            || ((ICACHE->ICACHE_SR & CACHE_SR_INVST_Msk) != 0U)) {
            cacheRestoreSucceeded = false;
        }

        timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
        while ((((DCACHE->DCACHE_CTRL & CACHE_CTRL_INV_Msk) != 0U)
            || ((DCACHE->DCACHE_SR & CACHE_SR_INVST_Msk) != 0U)) && timeout != 0U) {
            timeout--;
        }
        if (((DCACHE->DCACHE_CTRL & CACHE_CTRL_INV_Msk) != 0U)
            || ((DCACHE->DCACHE_SR & CACHE_SR_INVST_Msk) != 0U)) {
            cacheRestoreSucceeded = false;
        }

        if (cacheRestoreSucceeded) {
            ICACHE->ICACHE_IRQSTAT = FT32_CONFIG_CACHE_IRQ_ERROR_MASK;
            DCACHE->DCACHE_IRQSTAT = FT32_CONFIG_CACHE_IRQ_ERROR_MASK;
            __DSB();

            if (((ICACHE->ICACHE_IRQSTAT | DCACHE->DCACHE_IRQSTAT)
                & FT32_CONFIG_CACHE_IRQ_ERROR_MASK) != 0U) {
                cacheRestoreSucceeded = false;
            }
        }

        if (cacheRestoreSucceeded) {
            if ((cacheState & FT32_CONFIG_CACHE_STATE_DCACHE) != 0U) {
                DCACHE->DCACHE_CTRL |= CACHE_CTRL_CEN_Msk;
            }
            if ((cacheState & FT32_CONFIG_CACHE_STATE_ICACHE) != 0U) {
                ICACHE->ICACHE_CTRL |= CACHE_CTRL_CEN_Msk;
            }
            __DSB();

            if ((cacheState & FT32_CONFIG_CACHE_STATE_DCACHE) != 0U) {
                timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
                while ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_ENABLED && timeout != 0U) {
                    timeout--;
                }
                if ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_ENABLED) {
                    cacheRestoreSucceeded = false;
                }
            }

            if ((cacheState & FT32_CONFIG_CACHE_STATE_ICACHE) != 0U) {
                timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
                while ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_ENABLED && timeout != 0U) {
                    timeout--;
                }
                if ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_ENABLED) {
                    cacheRestoreSucceeded = false;
                }
            }

            if (((ICACHE->ICACHE_IRQSTAT | DCACHE->DCACHE_IRQSTAT)
                & FT32_CONFIG_CACHE_IRQ_ERROR_MASK) != 0U) {
                cacheRestoreSucceeded = false;
            }
        }

        if (!cacheRestoreSucceeded) {
            // Return to Flash only after both controllers are confirmed off.
            DCACHE->DCACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
            ICACHE->ICACHE_CTRL &= ~CACHE_CTRL_CEN_Msk;
            __DSB();

            timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
            while ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
                timeout--;
            }
            if ((ICACHE->ICACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
                goto ft32FlashReset;
            }

            timeout = FT32_CONFIG_CACHE_TRANSITION_TIMEOUT;
            while ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED && timeout != 0U) {
                timeout--;
            }
            if ((DCACHE->DCACHE_SR & CACHE_SR_CS_Msk) != FT32_CONFIG_CACHE_CS_DISABLED) {
                goto ft32FlashReset;
            }

            ICACHE->ICACHE_IRQSTAT = FT32_CONFIG_CACHE_IRQ_ERROR_MASK;
            DCACHE->DCACHE_IRQSTAT = FT32_CONFIG_CACHE_IRQ_ERROR_MASK;
            __DSB();
        }
    }

    __ISB();
#endif
    __DSB();
    __set_PRIMASK(savedPrimask);
    __ISB();
    return result;

ft32FlashReset:
    {
        // A stuck controller cannot safely return to code stored in Flash.
        volatile uint32_t *const aircr = &SCB->AIRCR;
        const uint32_t priorityGroup = *aircr & SCB_AIRCR_PRIGROUP_Msk;

        __DSB();
        *aircr = priorityGroup
            | (0x5FAUL << SCB_AIRCR_VECTKEY_Pos)
            | SCB_AIRCR_SYSRESETREQ_Msk;
        __DSB();
        __asm volatile ("1: b 1b" ::: "memory");
        __builtin_unreachable();
    }
#else
#error "MCU not catered for in configWriteWord for config_streamer"
#endif
    return CONFIG_RESULT_SUCCESS;
}

#endif // CONFIG_IN_FLASH
